import React from 'react'

const content = {
  laikes: {
    image: require('./images/laikes_katopsi.png'),
    text: `Στις παραδοσιακές λαϊκές κατοικίες βλέπει κανείς χαμηλά κτίσματα με ένα ή και δύο ορόφους.
Τα ισόγεια, με σμυρνέικο στυλ, περιλαμβάνουν κεντρικό διάδρομο με την κουζίνα στο βάθος και δύο ή τέσσερα δωμάτια δεξιά κι αριστερά του διαδρόμου (Τύπος Α).
Στα διώροφα, τα «δίπατα», το ισόγειο είναι χαμηλό σε ύψος. Είναι το "κατώι" που λειτουργεί ως στάβλος ή αποθήκη. Στο ανώι οδηγεί εσωτερική ή εξωτερική σκάλα. Εκεί βρίσκονται τα υπνοδωμάτια, η κρεβατοκάμαρα για το ζευγάρι κι ένα πιο μεγάλο δωμάτιο, η «μεγάλ’ κάμαρ’» το οποίο χρησιμοποιούσαν για να υποδέχονται τους καλεσμένους, αλλά και για τον ύπνο των παιδιών. (Τύπος Β)
Η ανάγκη διαχωρισμού των χώρων και των λειτουργιών του σπιτιού οδήγησαν στη δημιουργία της χαρακτηριστικής κατοικίας με "αξάτα", δηλαδή τη μικρή ή μεγαλύτερη υπερυψωμένη βεράντα του σπιτιού, στην οποία οδηγεί εξωτερική πέτρινη σκάλα. Ο όροφος φιλοξενεί και πάλι τα δωμάτια, ενώ στο κατώι βρίσκεται ο στάβλος, και οι αποθήκες ή το μαγειριό, με διαχωρισμένες πλέον εισόδους. (Τύπος Γ)
Τα περισσότερα σπίτια είχαν μια μικρή αυλή ή κήπο, με εξωτερικό φούρνο κι ένα μικρό βοηθητικό «παρασπίτι» για την αποθήκευση προϊόντων και τις βοηθητικές εργασίες.`
  },
  astikes: {
    image: require('./images/astikes_katopsi.png'),
    text: `Τα σπίτια των εύπορων οικογενειών, των εμπόρων ή των ανθρώπων που μετανάστευσαν και γύρισαν πλούσιοι είναι μεγάλα με πλούσια διακόσμηση. Συνήθως είναι διώροφα με τέσσερα ή και περισσότερα ευρύχωρα δωμάτια, με εσωτερική ξύλινη σκάλα, με εξώστη και εξωτερικά πέτρινη διακόσμηση. (Τύποι Δ & Ε)<br><br>
    Συχνά συναντά κανείς στοιχεία νεοκλασικής αρχιτεκτονικής και σπανιότερα χαρακτηριστικά κατοικιών της ηπειρωτικής Ελλάδας όπως τα "σαχνισιά", δηλαδή τις προεξοχές του ορόφου.<br><br>
    Τα πέτρινα χειροτεχνήματα που διακοσμούν τις αστικές κατοικίες εξυμνούν τις αρετές των ντόπιων μαστόρων της πέτρας.`
  }
}

require('./styles.scss')

const Page = ({params}) => {
  const {category} = params
  return (
    <div className="content">
      <div className="content-image">
        <img src={content[category].image} />
      </div>
      <div className="content-text" dangerouslySetInnerHTML={{__html: content[category].text}}></div>
    </div>
  )
}

export default Page
